Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: The main subject area deals with the understanding and communication of meaning through language.
nb: forklare hvorfor historikere og andre deler tidsløp inn i perioder og diskutere hvilke kriterier som ligger til grunn for dette

source: Furthermore, it deals with being able to evaluate the value of sources, hypotheses and models and being able to present the result from investigations in social sciences in written form.
nb: Videre handler det om å kunne vurdere verdier i kilder, hypoteser og modeller, og å kunne presentere resultater av samfunnsfaglige undersøkelser skriftlig.

source: It gives them an opportunity to express solidarity and demonstrates how they can support each other.
nb: Det gir dem mulighet til å uttrykke solidaritet og viser hvordan de kan gi hverandre støtte.

source: And within the limits of the kindergarten the use of them actually don’t represent a problem.
nb: Og ­innad i barnehagen er det egentlig ikke noe problem at de brukes.

source: The term has been highlighted since the first Framework Plan came in 1995,” tells researcher Berit Zachrisen.
nb: Begrepet har vært framhevet i alle rammeplaner for barnehagen siden den første planen kom i 1995, forteller forsker Berit Zachrisen.

source: Food and meals are important for our physical and mental health, and also for social well-being.
nb: Samisk historie og samfunn handler om å få innsikt i samisk historie, kultur, samfunnsliv og rettigheter.

source: explain the construction of dry couplings and how they work
nb: forklare konstruksjon av og virkemåte til tørre koplinger

source: The pupils also demonstrate and develop competence when they can use knowledge and skills to solve problems and explore mathematical relationships.
nb: Elevene viser og utvikler også kompetanse når de får bruke kunnskap og ferdigheter til å løse problemer og utforske matematiske sammenhenger.

source: Market strategy and market planning
nb: Markedsstrategi og markedsplanlegging

source: In recent years, national authorities have stressed the impor-
nb: Eksempler på ikke-kontinuerlige tekster er tabeller, kart, diagram og

source: give an account of the definition of a definite integral as a limit of a sum and an indefinite integral as an anti-derivative
nb: gjøre rede for definisjonen av bestemt integral som grense for en sum og ubestemt integral som antiderivert

source: A so-called Likert scale was used with the alternatives ‘Every lesson or almost every lesson’, ‘About half of the lessons’, ‘A few lessons’, ‘Never’.
nb: Det ble benyttet en såkalt Likert-skala med alternativene ”Hver eller nesten hver time”, ”Omtrent halvparten av timene”, ”Noen timer” og ”Aldri”.

source: Non-verbal communication related to verbal communication and the media’s role in communication and interaction is also covered by the main subject area.
nb: Ikke-verbal kommunikasjon knyttet til muntlig kommunikasjon og mediers rolle i kommunikasjon og samhandling inngår i hovedområdet.

source: Being able to read in composite texts deals with finding meaning in the entirety of the different forms of expression found in the text.
nb: Å kunne avlese en sammensatt tegnspråktekst dreier seg om å finne mening i helheten av ulike uttrykksformer i teksten.

source: investigate and evaluate different forms of loans and savings
nb: undersøke og vurdere ulike former for lån og sparing

source: which the teacher can use in pupil assessment work.
nb: Dimensjonsanalyse I i forhold til regioner

source: read simple texts with fluency and comprehension and then discuss the content
nb: forstå og samtale om innholdet i enkle tegnspråktekster

source: Eide and Winger admit that it has been challenging to study what quality means in the kindergartens.
nb: Eide og Winger innrømmer at det har vært utfordrende å forske på kvalitet i barnehager.

source: explain the reasons why there are two equal language forms and give an account of the language debate and linguistic variations in Norway in the present day
nb: vurdere estetiske virkemidler i sammensatte tekster hentet fra informasjons- og underholdningsmedier, reklame og kunst og reflektere over hvordan vi påvirkes av lyd, språk og bilder

source: Furthermore, it means using animation, simulations, digital maps and digital navigation systems.
nb: Videre betyr det å bruke animasjoner, simuleringer, digitale kart og digitale navigasjonssystemer.

source: It is expected that ongoing cooperation be maintained between home and school, which includes good information about how education should be planned and carried out.
nb: Det forutsettes løpende samarbeid mellom hjem og skole og god informasjon om hvordan opplæringen planlegges gjennomført.

source: in KRLE involves using spoken language to communicate and explain religions and philosophies of life, ethics and philosophy.
nb: i KRLE innebærer å bruke talespråket til å kommunisere og forklare religioner og livssyn, etikk og filosofi.

source: parts of their primary and secondary education and training in working life.
nb: Det er fylkeskommunen som utbetaler tilskudd til lærebedrifter og opplæringskontor.

source: be able to transform expressions of the form a sin(cx) + b cos(cx) into A sin(cx + φ) and be able to use the result in the analysis of functions and solving equations
nb: ”kunne skrive om uttrykk fra formen a sin(cx) + b cos(cx) til A sin (cx + φ) og kunne bruke resultatet til å analysere funksjoner og løse ligninger”

source: It also deals with the quality assurance of work processes and products.
nb: Videre dreier det seg om kvalitetssikring av arbeidsprosesser og produkter.

source: measure and compare magnitudes for length and area using suitable non-standard and standard measurement units, describe how this was done, and converse about the results
nb: måle og sammenligne størrelser som gjelder lengde og areal, ved hjelp av ikke-standardiserte og standardiserte måleenheter, beskrive hvordan og samtale om resultatene

source: ‘There are three good reasons for adults to support children’s development through play’, asserts Sørensen.
nb: Det er tre gode grunner til at voksne må støtte barnas lekutvikling, mener Sørensen.

source: The language used by the children in these interactions, was sparse.
nb: Språket barna brukte i disse sammenhengene, var fattig.

source: interpret and make working drawings and perspective drawings with several vanishing points, with and without digital tools
nb: tolke og lage arbeidstegninger og perspektivtegninger med flere forsvinningspunkter, med og uten digitale verktøy

source: And the rooms must be flexible.
nb: Og rommene må være fleksible.

source: of service delivery directed at vulnerable children, young people and their families in the Nordic countries?
nb: Kostnader til matservering i kommunale barnehager er ordinære driftskostnader og skal inngå i grunnlaget for beregning av tilskudd til ikke-kommunale barnehager.

source: The understanding often builds on an analysis of individual elements and how they are linked.
nb: Å utforske handler om å oppleve og eksperimentere og kan ivareta nysgjerrighet og undring.

source: focuses on in-depth studies of Islam and another elective religion.
nb: innebærer fordypning i islam og en annen valgfri religion.

source: Developing writing proficiency in Social science involves gradual training in building simple factual sentences and formulating specific questions, and the ability to repeat and summarise texts and be able to formulate problems and structure discursive text using source references.
nb: Utviklingen av skriveferdighetene i samfunnsfag innebærer gradvis oppøving fra å formulere enkle faktasetninger og konkrete spørsmål, over evne til å kunne gjengi og oppsummere tekster, til å kunne formulere problemstillinger og strukturere drøftende tekst med bruk av kildehenvisninger.

source: The two researchers made video observations in the nine kindergartens, then processed and analysed their observations in collaboration with Professor Ingrid Pramling Samuelsson.
nb: De to forskerne har gjort videoobservasjoner i de ni barnehagene og bearbeidet og analysert observasjonene sammen med professor Ingrid Pramling Samuelsson.

source: elaborate on social conditions and development of the state in Norway from around 700 to around 1500 and discuss possible influences from other cultures, societies and states
nb: gjøre rede for samfunnsforhold og statsutvikling i Norge fra ca 700 til ca 1500 og diskutere mulig påvirkning fra andre kulturer, samfunn og stater

source: create and programme algorithms with the use of variables, conditions
nb: diskutere tilfeldighet og sannsynlighet i spill og praktiske situasjoner

source: subjects, the pupils will acquire knowledge about how they learn and develop in each
nb: Tilskuddet gis også for kandidater som har inngått kontrakt om fagbrev på

source: otherwise by local or national health authorities.
nb: eller nasjonale helsemyndigheter.

source: ‘Gender is taken for granted’, in Rossholt’s opinion.
nb: Kjønn blir tatt for gitt, mener Rossholt.

source: Children and adolescents of today encounter an overwhelming amount of cultural influence and traditional values.
nb: Barn og unge i dag møter et mangfold av kulturpåvirkninger og verditradisjoner.

source: This includes the selection and working up of materials, plans, drawings, surveying and finances.
nb: I dette inngår valg, bruk og bearbeiding av materialer, planer, tegninger, landmåling og økonomi.

source: ‘Circle times were usually well-varied, lively and coloured by humour.
nb: – Samlingsstundene var i de fleste tilfellene varierte, livlige og preget av humor.

source: use modern radio communication equipment and follow emergency procedures
nb: bruke aktuelt radiokommunikasjonsutstyr og følge nødprosedyrer

source: The programme subjects cover the building, operation and maintenance of gardens, parks, recreational areas and sports facilities.
nb: Programfagene omfatter bygging, drift og vedlikehold av hager, parker, friområder og idrettsanlegg.

source: The development of reading in art and crafts progresses from being able to recognise and decode matters to critical reflection on visual instruments and cultural references.
nb: Utviklingen av å kunne lese i kunst og håndverk går fra å gjenkjenne og avkode til å reflektere kritisk over visuelle virkemidler og kulturelle referanser.

source: present an overview of the diversity of Buddhism, important historic events and Buddhism's position in Norway and the world today
nb: gi en oversikt over mangfoldet i buddhismen, viktige historiske hendelser og buddhismens stilling i Norge og verden i dag

source: in Politics, the individual and society involves searching for, critically evaluating, choosing and utilizing sources and sociological information on the Internet.
nb: i politikk, individ og samfunn innebærer å søke etter, vurdere kritisk, velge ut og bruke kilder og samfunnsfaglig informasjon på Internett.

source: Both inside and outside, also upon returning from the forest and entering the gate to the kindergarten you notice it.
nb: Dette gjelder både inne og ute, og når vi kommer tilbake fra skogen og går inn barnehageporten, er det også merkbart.

source: create, solve and explain equation sets relating to practical situations calculate the difference quotient for a linear function, and use it to
nb: lage, løse og forklare ligningssett knyttet til praktiske situasjoner regne ut stigningstallet til en lineær funksjon og bruke det til å forklare

source: The main area culture, society and literature focuses on cultural understanding in a broad sense.
nb: Hovedområdet kultur, samfunn og litteratur dreier seg om kulturforståelse i vid forstand.

source: Competence aims after Year Level 7
nb: Kompetansemål etter 7.

source: express themselves using a precise and varied vocabulary and master linguistic rules
nb: samtale om samfunnsspørsmål i språkområdet og om spørsmål knyttet til utdanning, yrkes- og arbeidsliv

source: in Communication and culture involves the presentation of independent projects to a public and the adaptation of one’s choice of linguistic and non-linguistic forms of expression to the target group and the situation at hand.
nb: i kommunikasjon og kultur innebærer å presentere selvstendige faglige arbeider for et publikum og tilpasse valg av språklige og ikke-språklige uttrykksformer til den aktuelle situasjonen og målgruppa.

source: This involves allowing for local variations in the scope of subjects between the main subject areas in order to satisfy competence aims for the subject.
nb: Dette innebærer at det vil være rom for lokale variasjoner i fordelingen mellom hovedområdene i faget for å oppfylle kompetansemålene.

source: give an account of the status of minority languages in Norway in the present day
nb: gjøre rede for hvilken status minoritetsspråk har i Norge i dag

source: The teacher and pupils shall engage in dialogue about their development of numeracy and understanding of numbers.
nb: Læreren skal være i dialog med elevene om utviklingen deres i regning og tallforståelse.

source: There is a general trend in TIMSS Advanced that this working method is prominent in all countries.
nb: Nå er det et generelt trekk i TIMSS Advanced at denne arbeidsmåten er framtredende i alle land.

source: how some environmental toxins can accumulate in food chains and
nb: hvordan noen miljøgifter kan akkumuleres i næringskjeder, og

source: The three researchers Åse Bratterud, Ellen Beate Hansen Sandseter and Monica Seland were interested in finding the answers.
nb: Det var de tre forskerne Åse Bratterud, Ellen Beater Hansen Sandseter og Monica Seland interessert i å fi nne ut.

source: this in various ways and switch between the different representations
nb: på ulike måter og oversette mellom de ulike representasjonene

source: use digital tools and other aids critically and independently
nb: beskrive tema og komposisjon i tekster og visuelle uttrykk

source: Environment, health and safety when working with laying out and levelling work is also included.
nb: Helse, miljø og sikkerhet i arbeid med stikking og nivelleringsarbeid inngår også.

source: Maps and surveying are discussed here, as well as digitalized maps and Global Position Systems (GPS).
nb: Det dreier seg om kart og kartlegging, digitale kart og GPS (Global Position System).

source: The vast majority have access to devices and the Internet at home and in kindergarten.
nb: De aller fleste har tilgang på både teknologi og Internett, og de har det både hjemme og i barnehagen.

source: The pupil develops writing competence by writing and reading and develops reading competence through reading and writing.
nb: Språkferdigheter og tekstforståelse utvikles gjennom lytting, lesing og skriving, og litteratur er en naturlig del av dette.

source: count to 100, divide and compose amounts up to 10, put together and divide groups of ten up to 100, and divide double-digit numbers in to tens and ones
nb: telle til 100, dele opp og bygge mengder opp til 10, sette sammen og dele opp tiergrupper opp til 100 og dele tosifrete tall i tiere og enere

source: argue for appropriate behaviour in nature Body and health
nb: argue for appropriate behaviour in nature Kropp og helse (Ernæring og helse)

source: explain why historians and others divide time into periods and discuss the criteria used for this
nb: forklare hvorfor historikere og andre deler tidsløp inn i perioder og diskutere hvilke kriterier som ligger til grunn for dette

source: Now the innovation project has become permanent.
nb: I dag har innovasjons-prosjektet blitt permanent.

source: interpret shapes and symbols from different cultures and use them in
nb: utforske hvordan mennesker har arbeidet for myndiggjøring og

source: Using digital tools may support and develop the pupils' communication and presentation skills.
nb: Bruk av digitale verktøy innebærer å kunne benytte nye lærings- og kommunikasjonsarenaer over store avstander.

source: describe the themes and composition in texts and visual expressions
nb: omhandler samers og andre sirkumpolare urfolks natur- religioner og religiøse og etiske tradisjoner.

source: It means participating in digital communication and information exchange.
nb: Det betyr å delta i digital kommunikasjon og informasjonsutveksling.

source: in Social studies means exploring, interpreting and reflecting over factual texts to understanding one’s own society and the societies of other peoples and other periods and places.
nb: i samfunnsfag innebærer å utforske, tolke og reflektere over faglige tekster for å forstå eget og andre samfunn, andre tider, steder og mennesker.

source: The connection between clubs and fans
nb: elev ikke har det trygt og godt.

source: English subject curriculum (ENG1-02)
nb: Læreplan i engelsk (ENG1-02)

source: It also involves the critical assessment and use of sources.
nb: Det dreier seg videre om kritisk vurdering og bruk av kilder.

source: When Merete Sørensen evaluated the kindergartens’ projects, she saw that the intensive efforts with drama-related play had strengthened the children’s ability to play.
nb: Da Merete Sørensen evaluerte barnehagenes prosjekt, så hun at det intensive arbeidet med dramalek hadde styrket barnas lekekompetanse.

source: It can be challenging for ‘urban Sámi’ to maintain their language and culture in the city.
nb: Det kan være en utfordring for «bysamene» å bevare språket og kulturen i byen.

source: The teacher shall provide guidance on further learning and adapt the teaching to enable the pupils to use the guidance provided to develop their competence in exploring and solving problems relating to numbers and patterns and in communicating with mathematical terminology.
nb: Læreren skal gi veiledning om videre læring og tilpasse opplæringen slik at elevene kan bruke veiledningen for å utvikle kompetansen sin i utforsking og problemløsing knyttet til tall og mønstre og kompetansen sin i kommunikasjon med matematiske begreper.

source: The teacher and the pupils shall engage in dialogue about their development in programming and strategies for solving problems.
nb: Det innebærer å kunne ta utgangspunkt i et skriftlig format og gjøre det om til en visuell framstilling og å ta i bruk grafisk notasjon.

source: Environmental debates present observations with a degree of reservation and uncertainty.
nb: I miljødebatter presenteres observasjoner med forbehold og usikkerhet.

source: understand and use common English words and phrases connected to day-to-day life, recreation and interests, both orally and in writing
nb: forstå og bruke vanlige engelske ord og uttrykk knyttet til dagligliv, fritid og interesser, både muntlig og skriftlig

source: ‘We do it like this.
nb: «Vi gjør sånn her.

source: ‘In the traditional preschools, I could see that the girls were more cautious than the boys.
nb: – I de tradisjonelle barnehagene så jeg at jentene var mer forsiktige enn guttene.

source: The two researchers sent a questionnaire to 10 per cent of all the ECEC institutions in one particular Swedish municipality.
nb: De to forskerne sendte et spørreskjema til 10 prosent av alle barnehagene i en svensk kommune.

source: elaborate on and discuss a selection of literature and factual prose from the period 1950 up to the present
nb: drøfte et utvalg av litteratur og sakprosa fra tiden etter 1950 og fram til i dag

source: Ellen Beate Hansen Sandseter and Monica Seland were eager to change that.
nb: Det ønsket Ellen Beate Hansen Sandseter og Monica Seland å endre på.

source: It is about the development of written and oral language skills, and about building a well-developed, nuanced vocabulary so that one can communicate about social issues.
nb: Det dreier seg om videreutvikling av skriftlige og muntlige språkferdigheter, og om å bygge opp et rikt og nyansert ordforråd for å kunne kommunisere om emner knyttet til litteratur, kultur og samfunn.

source: The programme subjects shall provide the basis for further professional training as an apprentice in aquaculture or via general studies in agriculture, fishing and forestry.
nb: Programfagene skal legge grunnlaget for videre yrkesutdanning som lærling i akvakultur eller videre studieforberedende utdanning i naturbruk.

source: talk about the history and distinctive characteristics of the Norwegian Humanist Association and humanistic philosophies of life from around the world
nb: forklare hva et humanistisk livssyn er og samtale om humanistisk livstolkning og etikk med vekt på virkelighetsforståelse, menneskesyn, aktuelle etiske utfordringer og utvalgte tekster fra humanistisk tradisjon

source: converse about cities, peoples and languages and plan and present a journey
nb: fortelle om viktige landskap og landskapsformer i Norge, noen andre land og i Sápmi/Sábme/Saepmie

source: Mathematics for the natural sciences - programme subject in programmes for Specialization in General Studies (MAT3-01)
nb: Læreplan i matematikk for realfag - programfag i utdanningsprogram for studiespesialisering (MAT3-01)

source: Young people become more ill than children, but to a lesser degree than adults.
nb: Antall besøkende bestemmes av muligheten til å holde avstand mellom personer.

source: analyse visual instruments in different types of media and highlight a
nb: reflektere over hvordan fortiden brukes i lokalmiljøet og av ulike

source: The teacher shall provide guidance on further learning and adapt the teaching to enable the pupils to use the guidance provided to develop their competence in seeing relationships between mathematics and theoretical applications.
nb: Læreren skal gi veiledning om videre læring og tilpasse opplæringen slik at elevene kan bruke veiledningen for å utvikle kompetansen sin i å bruke og sette sammen ulike elementer på en formålstjenlig måte og skape egne helhetlige uttrykk.

source: relation to competence aims in selected subject curricula.
nb: undervegs i opplæringa og etter at opplæringa er ferdig.

source: important laws, rules and norms and
nb: sentrale lover, regler og normer og

source: A lecturer at Aalborg University, he carried out this study in collaboration with his colleague Merete Monrad.
nb: Han er lektor ved Aalborg Universitet og har gjort denne studien sammen med sin kollega Merete Monrad.

source: explain the rights relating to the Sami language and on the extent to which the Sami languages are used in Norway, Sweden, Finland and Russia
nb: gjøre rede for og sammenligne tegnspråkliges og samiske/minoritetsspråkliges rettigheter i Norden og i andre deler av verden

source: Formative assessment shall help to promote learning and develop competence in the geography subject.
nb: Underveisvurderingen skal bidra til å fremme læring og til å utvikle kompetanse.

source: elaborate on important features of Sami history and discuss Sami relations with states having Sami settlements up to around 1800
nb: gjøre rede for sentrale trekk ved samisk historie og diskutere samenes forhold til stater med samisk bosetning fram til omkring midten av 1800-tallet

source: They don't always do that', according to researcher Lone Svinth.
nb: Det har de ikke alltid, mener Lone Svinth.

source: recognise some words, expressions and simple sentences in spoken and written texts
nb: hilse, stille og svare på enkle spørsmål, og bruke noen høflighetsuttrykk

source: While organizing the children in small groups with a common attachment person, the staff has thought a lot about when a grown-up starts or stops being sensitive.
nb: Underveis i arbeidet med å organisere barna i små grupper med felles tilknytningsperson har de ansatte tenkt mye på når voksne begynner og slutter å være sensitive.
